app/controllers/password_resets_controller.rb

UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2026-02-06 04:04:11.161421"], ["password_digest", "[FILTERED]"], ["id", 101]]
---
  def update
    if params[:user][:password].empty?                  # （3）への対応
      @user.errors.add(:password, "can't be empty")
      render 'edit', status: :unprocessable_entity
    elsif @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bbbb@b.b"], ["LIMIT", 1]]
---
    def get_user
      @user = User.find_by(email: params[:email])