app/controllers/relationships_controller.rb

  def create
    # @following_user = User.find(params[:followed_id])
    # @user = current_user
    # return if @user.following?(@following_user)
    # @user.follow(@following_user)
    @user = User.find(params[:followed_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]